// "The Switch Case" 

// როცა ბევრი სხვადასხვა ღილაკი გვაქვს (მაგალითად: Yes, No, Cancel, Retry), ბევრი if-else-ების წერა კოდს აჭრელებს. ამისთვის C-ში არსებობს switch.

// ამოცანა:
// მოდი, შევქმნათ ფანჯარა სამი ღილაკით: Abort, Retry, Ignore (MB_ABORTRETRYIGNORE).

// პირობა:

//     გამოიტანე ფანჯარა ტექსტით: "სისტემური შეცდომა! რას იზამ?"

//     გამოიყენე switch(result) და თითოეული შემთხვევისთვის (case) გამოიტანე შესაბამისი პასუხი:

//         IDABORT -> "პროგრამა წყდება."

//         IDRETRY -> "კიდევ ვცადოთ..."

//         IDIGNORE -> "ვაიგნორებთ და ვაგრძელებთ."