// დავალება: "მინი ბანკომატი" (Mini ATM)
// შექმენი პროგრამა, რომელიც იმუშავებს ბანკომატის პრინციპით:
//     საწყისი მონაცემი: ანგარიშზე თავიდანვე გაქვს 1000 ლარი.
//     ციკლი: მენიუ უნდა ტრიალებდეს (do-while), სანამ მომხმარებელი არ აირჩევს "გამოსვლას" (4).
//     ფუნქციები:
//         [1] ბალანსი: უბრალოდ აჩვენოს, რამდენი გაქვს.
//         [2] შეტანა: იკითხოს თანხა და დაამატოს ბალანსს.
//         [3] გატანა: იკითხოს თანხა. თუ ბალანსი ყოფნის -> გამოაკლოს, თუ არა -> დაწეროს "არ გაქვს საკმარისი თანხა".
//         [4] გამოსვლა: დაემშვიდობოს და გათიშოს პროგრამა.

#include <stdio.h>

int main()
{
    int balance = 1000;
    int choose;
    int amount;

        
    do {
        printf("%s\n", "[1] ბალანსის შემოწმება");
        printf("%s\n", "[2] თანხის შეტანა");
        printf("%s\n", "[3] თანხის გატანა");
        printf("%s\n", "[4] გამოსვლა");
        printf("%s\n","------------------");
        printf("%s", "ვარიანტი: ");
        scanf("%d", &choose);

        if (choose == 1)
        {
            printf("%d\n", balance);
        }


        else if (choose == 2){
        printf("რამდენის შეტანა გსურთ?: ");
        scanf("%d", &amount);
        balance = balance + amount;
        printf("ახლა ბალანსია %d\n", balance);
    }


        else if (choose == 3){
        printf("რამდენის გატანა გსურს?: ");
        scanf("%d", &amount);

        if (balance < amount){
         printf("თქვენ არგაქვთ საკმარისი თანხა");
        }

        else if (balance >= amount )
        {
           balance = balance - amount;
           printf("ბალანსზე დაგრჩათ %d\n", balance);
        }}


        else if (choose == 4) {
            printf("მადლობა, რომ სარგებლობთ ჩვენი ბანკით!\n");
        }

        else {
            printf("არასწორი არჩევანი, სცადეთ თავიდან.\n");
        }
    }while(choose !=4);

        return 0;
}