// ამოცანა: "რიცხვების ჯამი და საშუალო"

// დაწერე პროგრამა, რომელიც მომხმარებელს სთხოვს ორ მთელ რიცხვს, შემდეგ კი გამოითვლის და ეკრანზე გამოიტანს მათ ჯამს და საშუალო არითმეტიკულს.

// პირობები:

//     გამოიყენე scanf ფუნქცია რიცხვების შესაყვანად.

//     გამოიყენე printf პასუხის გამოსატანად.

//     ბონუსი: საშუალო არითმეტიკული იყოს ათწილადი (მაგალითად: 5-ის და 2-ის საშუალო არის 3.5).

#include <stdio.h>

 int main(){
    int number1;
    int number2;
    printf("შეიყვანე პირველი რიცხვი :");
    scanf("%d", &number1);
    printf("შეიყვანე მეორეი რიცხვი :");
    scanf("%d", &number2);
     
    double sashvalo = (number1+number2) / 2.0;


    // printf("%f", sashvalo); მთლაინ აწილადს ამოღებს
    printf("%.1f", sashvalo);
    

   return 0;
 }