// ამოცანა: "ლუწია თუ კენტი?"

// დაწერე პროგრამა, რომელიც:

//     მომხმარებელს სთხოვს შეიყვანოს ერთი მთელი რიცხვი.

//     ამოწმებს, არის თუ არა ეს რიცხვი ლუწი (even) ან კენტი (odd).

//     ეკრანზე გამოაქვს შესაბამისი შეტყობინება (მაგალითად: "რიცხვი ლუწია").
#include <stdio.h>

int main(){
    int number1;
    printf("შეიყვანე პირველი რიცხვი: ");
    scanf("%d", &number1);
    
    if(number1 % 2 ==0 ){
        printf("რიცხვი ლუწია");
    }
    else if (number1 % 2 !=0)
    {
        printf("რიცხვი კენტია");
    }

    return 0;
    



}