// ამოცანა: "რიცხვების შედარება და დიაპაზონი"

// დაწერე პროგრამა, რომელიც მომხმარებელს სთხოვს შეიყვანოს ერთი რიცხვი და შეამოწმებს მას სამ კატეგორიაში:

//     არის თუ არა რიცხვი დადებითი, უარყოფითი თუ ნული.

//     თუ რიცხვი დადებითია, დამატებით შეამოწმე: არის თუ არა ის 1-დან 100-მდე დიაპაზონში.
#include <stdio.h>

int main(){

    int num;
    printf("შეიყვანე რიცხვი: ");
    scanf("%d", &num);
    if (num >= 1 ){
        printf("რიცხვი დადებითია\n");
        if(num >=1 && num <=100){
            printf("რიცხვი 1-სა და 100-შორის არის");
        }
    }
    else if (num < 0)
    {
        printf("რიცხვი უარყოფითია");

    }
    else if (num==0)
    {
        printf("რიცხვი 0");
    }
    

    
return 0;
}