// ამოცანა 1: "საიდუმლო შიფრატორი" (მონაცემთა დაცვა)

// ჰაკერები ხშირად შიფრავენ თავიანთ მონაცემებს, რომ ანტივირუსმა ვერ იპოვოს. ერთ-ერთი უძველესი მეთოდია "კეისრის შიფრი".

// დავალება:
// დაწერე პროგრამა, რომელიც მომხმარებელს სთხოვს შეიყვანოს ერთი სიტყვა (მაგ: "HELLO") და თითოეულ ასოს "გადაწევს" 1-ით წინ (მაგ: 'A' გახდება 'B', 'B' გახდება 'C').
#include <stdio.h>

int main()
{
    char text[100];
    char d[100];
    char letter = 'A';
    letter = letter + 1;

    printf("შეიყვანეთ თქვენი ტექსტი: \n");
    fgets(text, sizeof(text), stdin);
    size_t i;
    for (i = 0; text[i] != '\0'; i++)
    {
        d[i] = text[i] + 1;
        if (text[i] >= 'A' && text[i] <= 'Z')
        {
            d[i] = (text[i] - 'A' + 1) % 26 + 'A';
        }
        else if (text[i] >= 'a' && text[i] <= 'z')
        {
            d[i] = (text[i] - 'a' + 1) % 26 + 'a';
        }
        else
        {
            d[i] = text[i];
        }
    }
    d[i] = '\0';

    printf("%s", d);
    return 0;
}