// წარმოიდგინე ასეთი სიტუაცია: შენ გაქვს სეიფი, რომელშიც დევს ფული. შენ არ გაქვს უფლება, პირდაპირ მიხვიდე და სეიფიდან ფული ამოიღო ან ჩადო.
//  შენ მხოლოდ შეგიძლია სეიფის მისამართი (ფურცელზე დაწერილი) მისცე "ბანკირს" (ფუნქციას) და უთხრა: "ამ მისამართზე რაც დევს, ის შეცვალე".
// მოდი, დავწეროთ ამოცანა, სადაც ფუნქცია changeValue ცვლის რიცხვს ისე, რომ მან არ იცის, ეს რიცხვი int-ია, float-ია თუ სხვა რამ.

// ამოცანის პირობა: "უნივერსალური განახლება"

// დაწერე პროგრამა, რომელიც:

//     შექმნის მთელ რიცხვს (int) საწყისი მნიშვნელობით 10.

//     შექმნის ფუნქციას, რომელიც არგუმენტად მიიღებს მხოლოდ void* მაჩვენებელს (მისამართს).

//     ეს ფუნქცია უნდა შევიდეს ამ მისამართზე და იქ არსებული რიცხვი შეცვალოს 25-ით.

//     ბოლოს, main ფუნქციაში დაბეჭდოს შეცვლილი რიცხვი.

#include <stdio.h>
void updateToTwentyFive(void* ptr) {
    
    *(int*)ptr=25;
}
int main(){
int mySecretNumber = 10;
printf("სანამ შეცვლება არის %d\n",mySecretNumber);

updateToTwentyFive(&mySecretNumber);

printf("ახლა არის %d", mySecretNumber);

}

